Jabber_User-InitialAssociation.template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/12.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:updateUser sequence="?">
         <userid>User_ID</userid>
         <userGroup>
                     <name>Standard End User Jabber Profile</name>
                     <userRoles>
                        <userRole>Standard CCM End Users</userRole>
                        <userRole>Standard CTI Allow Call Park Monitoring</userRole>
                        <userRole>Standard CTI Allow Control of All Devices</userRole>
                        <userRole>Standard CTI Allow Control of Phones supporting Connected Xfer and conf</userRole>
                        <userRole>Standard CTI Enabled</userRole>
                     </userRoles>
                  </userGroup>
         <homeCluster>true</homeCluster>
         <imAndPresenceEnable>true</imAndPresenceEnable>
         <serviceProfile uuid="{0078198a-4aa0-c5d2-ebaa-2f905b9dd777}">UCServiceProfile_Default</serviceProfile>
      </ns:updateUser>
   </soapenv:Body>
</soapenv:Envelope>
